// ❓ Натан любит кататься на велосипеде.

// Поскольку Натан знает, насколько важно поддерживать водный баланс, он выпивает 0,5 литра воды за час езды на велосипеде.

// Вам дано время в часах, и вам нужно вернуть количество литров, которое выпьет Натан, округлив до наименьшего значения.

// Например:

// time = 3 ----> litres = 1

// time = 6.7---> litres = 3

// time = 11.8--> litres = 5

// ✅ SOLUTION:
function litres(time) {
    let h = 1/2
    return Math.floor(h * time)
  }

  console.log(litres(11,8));
