//❓Напишите функцию для получения первого(ых) элемента(ов) последовательности. Передача параметра n(default= 1) вернет первый n(ые) элемент(ы) последовательности.
//
// Если n== 0вернуть пустую последовательность[]
//
// Примеры
// var arr = ['a', 'b', 'c', 'd', 'e'];
// first(arr) //=> ['a'];
// first(arr, 2) //=> ['a', 'b']
// first(arr, 3) //=> ['a', 'b', 'c'];
// first(arr, 0) //=> [];
// ✅ SOLUTION:

function first(arr, n = 1) {
    if (n === 0) return [];
    return arr.slice(0, n);
}

var arr = ['a', 'b', 'c', 'd', 'e'];
console.log(first(arr))
