// ❓Первый входной массив — это ключ к правильным ответам на экзамен, например ["a", "a", "b", "d"]. Второй содержит отправленные ответы студента.

// Два массива не пустые и имеют одинаковую длину. Верните оценку для этого массива ответов, указав +4для каждого правильного ответа, -1для каждого неправильного ответа и +0для каждого пустого ответа, представленного в виде пустой строки (в C используется символ пробела).

// Если оценка < 0, вернуть 0.

// Например:

//     Correct answer    |    Student's answer   |   Result         
//  ---------------------|-----------------------|-----------
//  ["a", "a", "b", "b"]   ["a", "c", "b", "d"]  →     6
//  ["a", "a", "c", "b"]   ["a", "a", "b", "" ]  →     7
//  ["a", "a", "b", "c"]   ["a", "a", "b", "c"]  →     16
//  ["b", "c", "b", "a"]   ["" , "a", "a", "c"]  →     0

// ✅ SOLUTION:

   function checkExam(array1, array2) {
    let res = 0;

    for (let i = 0; i < array1.length; i++) {
        if (array2[i] === '') {
            res += 0;
        } else if (array2[i] === array1[i]) {
            res += 4;
        } else {
            res -= 1;
        }
    }

    return res < 0 ? 0 : res;
}
console.log(checkExam(["a", "a", "b", "b"], ["a", "c", "b", "d"]));