// ❓ Вам будет дан массив чисел. Вам нужно отсортировать нечетные числа в порядке возрастания, оставив четные числа на своих исходных позициях.

// Примеры
// [7, 1]  =>  [1, 7]
// [5, 8, 6, 3, 4]  =>  [3, 8, 6, 5, 4]
// [9, 8, 7, 6, 5, 4, 3, 2, 1, 0]  =>  [1, 8, 3, 6, 5, 4, 7, 2, 9, 0]


// ✅ SOLUTION:

function sortArray(array) {

const a =  array.filter(i => i % 2 !== 0)
const b =  a.sort((a,b) => a-b)
let index = 0
const res = array.map(i =>{
        if(i % 2 !== 0) {
            return b[index++]
        }
        return i
    })
return res
  }



  console.log(sortArray([ 15, +0, 26, -24, 48, 25, 50, -44, 14, -12, 31, -8, 39, -47 ]));
